      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. C-LOOK-DISK-ALGORITHM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NO-PROC PIC 9(2) VALUE ZEROES.
       01 WS-START PIC 9(3) VALUE ZEROES.
       01 WS-PREV PIC 9(3) VALUE ZEROES.
       01 I PIC 9(3) VALUE ZEROES.
       01 J PIC 9(3) VALUE ZEROES.
       01 TEMP PIC 9(3) VALUE ZEROES.
       01 WS-START-IDX PIC 9(3) VALUE ZEROES.
       01 WS-THM PIC 9(4) VALUE ZEROES.
       01 WS-HEAD-M PIC 9(4) VALUE ZEROES.
       01 WS-P1S PIC 9(3) VALUE ZEROES.
       01 WS-P2S PIC 9(3) VALUE ZEROES.
       01 WS-PROCESSES OCCURS 0 TO 100 DEPENDING ON WS-NO-PROC.
         02 WS-PROC PIC 9(3) VALUE ZEROES.
       01 WS-PR PIC 9(3) VALUE ZEROES.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "C-LOOK DISK ALGORITHM".
      *    GETTING THE NUMBER OD PROCESSES
           DISPLAY "ENTER NO. OF PROCESS: " WITH NO ADVANCING.
           ACCEPT WS-NO-PROC.
      *    ADDING 1 TO NUMBER OF PROCESSES TO OCCUPY THE STARTING HEAD
           ADD 1 TO WS-NO-PROC.
      *    GETTING THE STARTING POINT OF THE HEAD
           DISPLAY "ENTER THE STARTING POINT: " WITH NO ADVANCING.
           ACCEPT WS-START.
      *    GETTING THE PREVIOUS LOCATION OF THE HEAD
           DISPLAY "ENTER PREVIOUS POSITION: " WITH NO ADVANCING.
           ACCEPT WS-PREV.
      *    PUTTING THE STARTING HEAD TO THE PROCESSES
           MOVE WS-START TO WS-PROCESSES(1).
      *    LOOP TO GET THE INPUTS
           PERFORM VARYING I FROM 2 BY 1 UNTIL I > WS-NO-PROC
             DISPLAY "ENTER A PROCESS: " WITH NO ADVANCING
             ACCEPT WS-PR
      *      MOVING THE INPUT TO THE TABLE
             MOVE WS-PR TO WS-PROCESSES(I)
           END-PERFORM.
      *    SORTING THE PROCESSES ASCENDINGLY
           PERFORM BUBBLE-SORT.
      *    FINDING THE STARTING HEAD TO THE SORTED TABLE
           PERFORM FIND-START.
      *    CHECKING FOR THE DIRECTION OF THE HEAD IF IT IS LOWER
      *    OR HIGHER
           IF WS-PREV > WS-START THEN
             PERFORM HILO
           ELSE
             PERFORM LOHI
           END-IF.
           STOP RUN.
      * HILO PARAGRAPH TO MOVE FROM HIGHER CYLINDER TO LOWER CYLINDER
      * THEN REACHING THE LOWEST REQUEST WILL MOVE TO THE HIGHEST
      * REQUEST CHECKING FOR THE REMAINING REQUESTS
       HILO.
      *    LOOPING FROM THE STARTING INDEX TO THE LOWEST REQUEST
           PERFORM VARYING I FROM WS-START-IDX BY -1 UNTIL I < 2
      *      MOVING THE ELEMENTS TO P1S AND P2S
             MOVE WS-PROCESSES(I) TO WS-P1S
             MOVE WS-PROCESSES(I - 1) TO WS-P2S
      *      COMPUTING FOR THE HEAD MOVEMENT
             COMPUTE WS-HEAD-M = WS-P1S - WS-P2S
      *      DISPLAYING THE HEAD MOVEMENT
             DISPLAY "HEAD MOVEMENT: " WS-HEAD-M
      *      ADDING THE HEAD MOVEMENT TO THE TOTAL HEAD MOVEMENT
             COMPUTE WS-THM = WS-THM + WS-HEAD-M
           END-PERFORM.
      *    LOOPING FROM THE HIGHEST REQUEST UNTIL
      *    THE NEXT INDEX OF STARTING INDEX
           PERFORM VARYING I FROM WS-NO-PROC BY -1 UNTIL I <=
           WS-START-IDX + 1
      *        MOVING THE ELEMENTS TO THE P1S AND P2S
               MOVE WS-PROCESSES(I) TO WS-P1S
               MOVE WS-PROCESSES(I - 1) TO WS-P2S
      *      COMPUTING FOR THE HEAD MOVEMENT
             COMPUTE WS-HEAD-M = WS-P1S - WS-P2S
      *      DISPLAYING THE HEAD MOVEMENT
             DISPLAY "HEAD MOVEMENT: " WS-HEAD-M
      *      ADDING THE HEAD MOVEMENT TO THE TOTAL HEAD MOVEMENT
             COMPUTE WS-THM = WS-THM + WS-HEAD-M
           END-PERFORM.
      *    DISPLAYING THE TOTAL HEAD MOVEMENT
           DISPLAY "THM: " WS-THM.
           EXIT.
      * LOHI PARAGRAPH TO MOVE FROM LOWER CYLINDER TO HIGHER CYLINDER
      * THEN REACHING THE HIGHERST REQUEST WILL MOVE TO THE LOWEST
      * REQUEST CHECKING FOR THE REMAINING REQUESTS
       LOHI.
      *    LOOPING FROM THE STARTING INDEX TO THE HIGHEST REQUEST
           PERFORM VARYING I FROM WS-START-IDX BY 1 UNTIL I >
           WS-NO-PROC - 1
      *      MOVING THE ELEMENTS TO P1S AND P2S
             MOVE WS-PROCESSES(I + 1) TO WS-P1S
             MOVE WS-PROCESSES(I) TO WS-P2S
      *      COMPUTING FOR THE HEAD MOVEMENT
             COMPUTE WS-HEAD-M = WS-P1S - WS-P2S
      *      DISPLAYING THE HEAD MOVEMENT
             DISPLAY "HEAD MOVEMENT: " WS-HEAD-M
      *      ADDING THE HEAD MOVEMENT TO THE TOTAL HEAD MOVEMENT
             COMPUTE WS-THM = WS-THM + WS-HEAD-M
           END-PERFORM.
      *    LOOPING FROM THE LOWEST REQUEST UNTIL
      *    THE NEXT INDEX OF STARTING INDEX
           PERFORM VARYING I FROM 1 BY 1 UNTIL I >=
           WS-START-IDX - 1
      *        MOVING THE ELEMENTS TO THE P1S AND P2S
               MOVE WS-PROCESSES(I  + 1) TO WS-P1S
               MOVE WS-PROCESSES(I) TO WS-P2S
      *      COMPUTING FOR THE HEAD MOVEMENT
             COMPUTE WS-HEAD-M = WS-P1S - WS-P2S
      *      DISPLAYING THE HEAD MOVEMENT
             DISPLAY "HEAD MOVEMENT: " WS-HEAD-M
      *      ADDING THE HEAD MOVEMENT TO THE TOTAL HEAD MOVEMENT
             COMPUTE WS-THM = WS-THM + WS-HEAD-M
           END-PERFORM.
      *    DISPLAYING THE TOTAL HEAD MOVEMENT
           DISPLAY "THM: " WS-THM.
           EXIT.
      * BUBBLE SORT PARAGRAPH
       BUBBLE-SORT.
           PERFORM VARYING I FROM 1 BY 1 UNTIL I >= WS-NO-PROC
             PERFORM VARYING J FROM 1 BY 1 UNTIL J > (WS-NO-PROC - I)
               IF WS-PROCESSES(J) > WS-PROCESSES(j + 1) THEN
                 MOVE WS-PROCESSES(J) TO TEMP
                 MOVE WS-PROCESSES(J + 1) TO WS-PROCESSES(J)
                 MOVE TEMP TO WS-PROCESSES(J + 1)
               END-IF
             END-PERFORM
           END-PERFORM.
           EXIT.
      * FIND START PARAGRAPH
       FIND-START.
      *    LOOPING TO FIND THE STARTING HEAD OF THE LOOK ALGORITHM
           PERFORM VARYING I FROM 1 BY 1 UNTIL I >= WS-NO-PROC
             IF WS-PROCESSES(I) IS EQUAL TO WS-START
               MOVE I TO WS-START-IDX
             END-IF
           END-PERFORM.
           EXIT.
       END PROGRAM C-LOOK-DISK-ALGORITHM.
