      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. DISK-SCHEDULING.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 WS-SIZE PIC 99 VALUE ZEROES.
       01 WS-PROC PIC 99 VALUE ZEROES.
       01 WS-NUM-PROC PIC 9(2) VALUE ZEROES.
       01 WS-HEAD PIC 99 VALUE ZEROES.
       01 TEMP PIC 9(2).
       01 WS-P1S PIC 99 VALUE ZEROES.
       01 WS-P2S PIC 99 VALUE ZEROES.
       01 WS-SUM PIC 999 VALUE ZEROES.
       01 WS-RES PIC 999 VALUE ZEROES.
       01 WS-PROCESSES OCCURS 30 TIMES INDEXED BY WS-IDX.
           02 WS-PROCESS PIC 9(2) VALUE ZEROES.
       01 WS-P-SUM OCCURS 30 TIMES INDEXED BY WS-ID-X.
           02 WS-S PIC 9(2) VALUE ZEROES.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "FIRST COME FIRST SERVE".
      *     INPUT DISK SIZE
            DISPLAY "ENTER DISK SIZE: " WITH NO ADVANCING.
            ACCEPT WS-SIZE.
      *     NO. PROCESS
            DISPLAY "ENTER NUMBER OF PROCESS: " WITH NO ADVANCING.
            ACCEPT WS-NUM-PROC.
      *     STARTING POINT OF THE HEAD
            DISPLAY "ENTER STARTING POINT: " WITH NO ADVANCING.
            ACCEPT WS-HEAD.
      *     MOVING START TO 1ST INDEX OF THE TABLE
            MOVE WS-HEAD TO WS-PROCESSES(1).
      *     LOOP TO GET INPUTS
            PERFORM VARYING TEMP FROM 2 BY 1 UNTIL TEMP > WS-NUM-PROC
            + 1
               DISPLAY "ENTER A PROCESS: " WITH NO ADVANCING
      *        ACCEPTING INPUTS
               ACCEPT WS-PROC
      *        MOVING THE INPUT TO THE ARRAY BASED ON CERTAIN INDEX
               MOVE WS-PROC TO WS-PROCESSES(TEMP)
            END-PERFORM.
      *     PERFORMING COMPUTATION FOR FCFS
            PERFORM COMPUTE-P.
      *     DISPLAYING THE TOTAL HEAD MOVEMENT
            DISPLAY "THM: " WS-SUM.
            STOP RUN.
      * DECLARATION OF COMPUTE-P PARAGRAPH
       COMPUTE-P.
      *    PERFORM COMPUTATION FROM 1 TO NUMBER OF PROCESS
           PERFORM VARYING TEMP FROM 1 BY 1 UNTIL TEMP > WS-NUM-PROC
      *    GETTING THE NEXT INDEX SUBTRACTING TO THE CURRENT INDEX
           SET WS-P1S TO WS-PROCESSES(TEMP + 1)
           SET WS-P2S TO WS-PROCESSES(TEMP)
      *    COMPUTING THE HEAD MOVEMENT OF FROM P2S TO P1S
           COMPUTE WS-RES = WS-P1S - WS-P2S
      *    DISPLAYING THE DIFFERENCE
           DISPLAY "HEAD MOVEMENT: " WS-RES
      *    ADDING THE DIFFERENCE TO THE TOTAL HEAD MOVEMENT
           COMPUTE WS-SUM = WS-SUM + WS-RES
           END-PERFORM.
           EXIT.
       END PROGRAM DISK-SCHEDULING.
